lib/animations/popin.org
#+title: popin

* =popin= / =popout=
=popin= is a spring from a =scale= of =0= up to =1=. Use it like:
#+begin_src tsx
const ref = createRef<Rect>();
view.add(<Rect width={500} height={500} />)

// make sure the scale is 0 initially, if there are other animations before it
ref().scale(0);

yield* popin(ref);
#+end_src

If you are using =createRefArray= then you will need to wrap the ref in a function:
#+begin_src tsx
yield* popin(() => ref[0]);
#+end_src

=popout= is the opposite of =popin=.

* =popinSize= / =popoutSize=
The same as [[=popin= / =popout=][=popin= / =popout=]] but using the =size= instead of the =scale=.
